app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`, `username`, `password_salt`, `password_hash`, `email`) VALUES('2010-03-02 05:45:11', '2010-03-02 05:45:11', 'phtphan', 'dd7aa23ffa15fa31ce66cf10e0c9c71784ed9661', 'e8b3f3f3193429742985059d14bacabf96ac4212', 'phtphan@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save